TexasInstruments/c2000ware-core-sdk/libraries/communications/usb/f2838x/source/device/usbdhid.c
}

//*****************************************************************************
//
// This function is called to clear the counter used to keep track of the time
// elapsed since a given report was last sent.
//
// \param psHIDDevice points to the HID device structure whose report timer is
// to be cleared.
// \param ui8ReportID is the first byte of the report to be sent.  If this
// device offers more than one input report, this value is used to find the
// relevant report timer structure in the psHIDDevice structure.
//
// \return None.
//
//*****************************************************************************
static void
ClearReportTimer(const tUSBDHIDDevice *psHIDDevice, uint8_t ui8ReportID)
{
    uint32_t ui32Loop;

    if(psHIDDevice->ui8NumInputReports > 1)
    {
        //
        // We have more than 1 input report so the report must begin with a
        // byte containing the report ID.  Scan the table we were provided
        // when the device was initialized to find the entry for this report.
        //
        for(ui32Loop = 0; ui32Loop < psHIDDevice->ui8NumInputReports;
            ui32Loop++)
        {
            if(psHIDDevice->psReportIdle[ui32Loop].ui8ReportID == ui8ReportID)
            {
                break;
            }
        }
    }
    else
    {
        ui32Loop = 0;
    }

    //
    // If we drop out of the loop with an index less than ui8NumInputReports,
    // we found the relevant report so clear its timer.
    //
    if(ui32Loop < psHIDDevice->ui8NumInputReports)
    {
        psHIDDevice->psReportIdle[ui32Loop].ui32TimeSinceReportmS = 0;
    }
}

//*****************************************************************************
//
// This function is called to clear the idle period timers for each input
// report supported by the device.
//
// \param psHIDDevice points to the HID device structure whose timers are to be
// cleared.
// \param ui32TimemS is the elapsed time in milliseconds since the last call
// to this function.
//
// \return None.
//
//*****************************************************************************
static void
ClearIdleTimers(const tUSBDHIDDevice *psHIDDevice)
{
    uint32_t ui32Loop;

    //
    // Clear the "time till next report" counters for each input report.
    //
    for(ui32Loop = 0; ui32Loop < psHIDDevice->ui8NumInputReports; ui32Loop++)
    {
        psHIDDevice->psReportIdle[ui32Loop].ui16TimeTillNextmS =
                        psHIDDevice->psReportIdle[ui32Loop].ui8Duration4mS * 4;
    }
}

//*****************************************************************************
//
// This function is called periodically to allow us to process the report idle
// timers.
//
// \param psHIDDevice points to the HID device structure whose timers are to be
// updated.
// \param ui32ElapsedmS indicates the number of milliseconds that have elapsed
// since the last call to this function.
//
// \return None.
//
//*****************************************************************************
static void
ProcessIdleTimers(const tUSBDHIDDevice *psHIDDevice, uint32_t ui32ElapsedmS)
{
    uint32_t ui32Loop, ui32SizeReport;
    void *pvReport;
    tHIDInstance *psInst;
    bool bDeferred;

    //
    // Get our instance data pointer
    //
    psInst = &((tUSBDHIDDevice *)psHIDDevice)->sPrivateData;

    //
    // We have not had to defer any report transmissions yet.
    //
    bDeferred = false;

    //
    // Look at each of the input report idle timers in turn.
    //
    for(ui32Loop = 0; ui32Loop < psHIDDevice->ui8NumInputReports; ui32Loop++)
    {
        //
        // Update the time since the last report was sent.
        //
        psHIDDevice->psReportIdle[ui32Loop].ui32TimeSinceReportmS +=
                                                                ui32ElapsedmS;

        //
        // Is this timer running?
        //
        if(psHIDDevice->psReportIdle[ui32Loop].ui8Duration4mS)
        {
            //
            // Yes - is it about to expire?
            //
            if(psHIDDevice->psReportIdle[ui32Loop].ui16TimeTillNextmS <=
               ui32ElapsedmS)
            {
                //
                // The timer is about to expire.  Can we send a report right
                // now?
                //
                if((psInst->iHIDTxState == eHIDStateIdle) &&
                   (psInst->bSendInProgress == false))
                {
                    //
                    // We can send a report so send a message to the
                    // application to retrieve its latest report for
                    // transmission to the host.
                    //
                    ui32SizeReport = psHIDDevice->pfnRxCallback(
                               psHIDDevice->pvRxCBData,
                               USBD_HID_EVENT_IDLE_TIMEOUT,
                               psHIDDevice->psReportIdle[ui32Loop].ui8ReportID,
                               &pvReport);

                    //
                    // Schedule the report for transmission.
                    //
                    USBDHIDReportWrite((void *)psHIDDevice, pvReport,
                                       ui32SizeReport, true);

                    //
                    // Reload the timer for the next period.
                    //
                    psHIDDevice->psReportIdle[ui32Loop].ui16TimeTillNextmS =
                        psHIDDevice->psReportIdle[ui32Loop].ui8Duration4mS * 4;
                }
                else
                {
                    //
                    // We can't send the report straight away so flag it for
                    // transmission as soon as the previous transmission ends.
                    //
                    psHIDDevice->psReportIdle[ui32Loop].ui16TimeTillNextmS = 0;
                    bDeferred = true;
                }
            }
            else
            {
                //
                // The timer is not about to expire.  Update the time till the
                // next report transmission.
                //
                psHIDDevice->psReportIdle[ui32Loop].ui16TimeTillNextmS -=
                                                                ui32ElapsedmS;
            }
        }
    }

    //
    // If we had to defer transmission of any report, remember this so that we
    // will process it as soon as possible.
    //
    SetDeferredOpFlag(&psInst->ui16DeferredOpFlags, HID_DO_SEND_IDLE_REPORT,
                      bDeferred);
}

static void
SetIdleTimeout(const tUSBDHIDDevice *psHIDDevice, uint8_t ui8ReportID,
               uint8_t ui8Timeout4mS)
{
    uint32_t ui32Loop;
    bool bReportNeeded;
    tHIDReportIdle *psIdle;

    //
    // Remember that we have not found any report that needs to be sent
    // immediately.
    //
    bReportNeeded = false;

    //
    // Search through all the input reports looking for ones that fit the
    // requirements.
    //
    for(ui32Loop = 0; ui32Loop < psHIDDevice->ui8NumInputReports; ui32Loop++)
    {
        psIdle = &psHIDDevice->psReportIdle[ui32Loop];

        //
        // If the report ID passed matches the report ID in the idle timer
        // control structure or we were passed a report ID of zero, which
        // indicates that all timers are to be set...
        //
        if(!ui8ReportID || (ui8ReportID == psIdle->ui8ReportID))
        {
            //
            // Save the new duration for the idle timer.
            //
            psIdle->ui8Duration4mS = ui8Timeout4mS;

            //
            // Are we enabling the idle timer?  If so, fix up the time until it
            // needs to fire.
            //
            if(ui8Timeout4mS)
            {
                //
                // Determine what the timeout is for this report given the time
                // since the last report of this type was sent.
                //
                if(psIdle->ui32TimeSinceReportmS >=
                   ((uint32_t)ui8Timeout4mS * 4))
                {
                    psIdle->ui16TimeTillNextmS = 0;
                    bReportNeeded = true;
                }
                else
                {
                    psIdle->ui16TimeTillNextmS =
                                        (((uint16_t)ui8Timeout4mS * 4) -
                                         psIdle->ui32TimeSinceReportmS);
                }
            }
        }
    }

    //
    // If we get to here and bReportNeeded is true, this means we need to
    // send back at least one of the input reports as soon as possible.  Try
    // to do this immediately.
    //
    if(bReportNeeded)
    {
        ProcessIdleTimers(psHIDDevice, 0);
    }
}

//*****************************************************************************
//
// Find the idle timeout for a given HID input report.
//
// \param psHIDDevice points to the HID device whose report idle timeout is to
// be found.
// \param ui8ReportID identifies the report whose timeout is requested.  If 0,
// the timeout for the first report is returns, regardless of its ID (or
// whether it has one).
//
// This function returns the current idle timeout for a given HID input report.
// The value returned is expressed in terms of 4mS intervals.  Convert to
// milliseconds by multiplying by 4.  If the return value is 0, this indicates
// that an infinite timeout is currently set and the device will not send the
// report unless a state change occurs.
//
// \return Returns the current idle timeout for the given report.
//
//*****************************************************************************
static uint32_t
GetIdleTimeout(const tUSBDHIDDevice *psHIDDevice, uint8_t ui8ReportID)
{
    uint32_t ui32Loop;
    tHIDReportIdle *psIdle;

    //
    // Search through all the input reports looking for ones that fit the
    // requirements.
    //
    for(ui32Loop = 0; ui32Loop < psHIDDevice->ui8NumInputReports; ui32Loop++)
    {
        psIdle = &psHIDDevice->psReportIdle[ui32Loop];

        //
        // If the report ID passed matches the report ID in the idle timer
        // control structure or we were passed a report ID of zero, which
        // indicates that all timers are to be set...
        //
        if(!ui8ReportID || (ui8ReportID == psIdle->ui8ReportID))
        {
            //
            // We found a report matching the required ID or we were not passed
            // an ID and we are looking at the first report information.
            //
            return((uint32_t)psIdle->ui8Duration4mS);
        }
    }

    //
    // If we drop out, the report could not be found so we need to indicate
    // an error.
    //
    return(HID_NOT_FOUND);
}

//*****************************************************************************
//
// Find the n-th HID class descriptor of a given type in the client-provided
// descriptor table.
//
// \param psHIDDevice points to the HID device which is to be searched for the
// required class descriptor.
// \param ui8Type is the type of class descriptor being requested.  This will
// be either USB_HID_DTYPE_REPORT or USB_HID_DTYPE_PHYSICAL.
// \param ui32Index is the zero-based index of the descriptor that is being
// requested.
//
// This function parses the supplied HID descriptor to find the index into the
// sClassDescriptor array that corresponds to the requested descriptor.  If
// a descriptor with the requested index does not exist, HID_NOT_FOUND will be
// returned unless the request is for a physical descriptor and at least one
// such descriptor exists.  In this case, the index returned will be for the
// last physical descriptor (as required by the HID spec 7.1.1).
//
// \return Returns the index of the descriptor within the sClassDescriptor
// of the tHIDDevice structure if found or HID_NOT_FOUND otherwise.
//
//*****************************************************************************
static uint32_t
FindHIDDescriptor(const tUSBDHIDDevice *psHIDDevice, uint8_t ui8Type,
                  uint32_t ui32Index, uint32_t *pui32Len)
{
    bool bFoundType;
    uint32_t ui32Loop, ui32Count, ui32LastFound;
    const tHIDClassDescriptorInfo *psDesc;

    //
    // Remember that we have not found any descriptor with a matching type yet.
    //
    bFoundType = false;
    ui32Count = 0;
    ui32LastFound = 0;

    //
    // Walk through all the class descriptors looking for the one which
    // matches the requested index and type.
    //
    for(ui32Loop = 0; ui32Loop < psHIDDevice->psHIDDescriptor->bNumDescriptors;
        ui32Loop++)
    {
        psDesc = &(psHIDDevice->psHIDDescriptor->sClassDescriptor[ui32Loop]);
        if(psDesc->bDescriptorType == ui8Type)
        {
            //
            // We found a descriptor of the correct type.  Is this the
            // correct index?
            //
            bFoundType = true;

            //
            // Is this the descriptor we are looking for?
            //
            if(ui32Count == ui32Index)
            {
                //
                // Yes - we found it so return the index and size to the
                // caller.
                //
#ifdef __TMS320C28XX__
                *pui32Len = (uint32_t)readusb16_t(&(psDesc->wDescriptorLength));
#else
                *pui32Len = (uint32_t)psDesc->wDescriptorLength;
#endif
                return(ui32Loop);
            }
            else
            {
                //
                // Update our count and keep looking.  Remember where we were
                // when we found this descriptor in case we need to return the
                // last physical descriptor.
                //
                ui32Count++;
                ui32LastFound = ui32Loop;
            }
        }
    }

    //
    // If we drop out, we did not find the requested descriptor.  Now handle
    // the special case of a physical descriptor - if we found any physical
    // descriptors, return the last one.
    //
    if((ui8Type == USB_HID_DTYPE_PHYSICAL) && bFoundType)
    {
        //
        // Get the length of the last descriptor we found.
        //
        psDesc =
            &(psHIDDevice->psHIDDescriptor->sClassDescriptor[ui32LastFound]);
#ifdef __TMS320C28XX__
        *pui32Len = (uint32_t)readusb16_t(&(psDesc->wDescriptorLength));
#else
        *pui32Len = (uint32_t)psDesc->wDescriptorLength;
#endif

        //
        // Return the index to the caller.
        //
        return(ui32LastFound);
    }
    else
    {
        //
        // We could not find the descriptor so return an appropriate error.
        //
        return(HID_NOT_FOUND);
    }
}

//*****************************************************************************
//
// Schedule transmission of the next packet forming part of an input report.
//
// \param psHIDInst points to the HID device instance whose input report is to
// be sent.
//
// This function is called to transmit the next packet of an input report
// passed to the driver via a call to USBDHIDReportWrite.  If any data remains
// to be sent, a USB packet is written to the FIFO and scheduled for
// transmission to the host.  The function ensures that reports are sent as
// a sequence of full packets followed by either a single int16_t packet or a
// packet with no data to indicate the end of the transaction.
//
//*****************************************************************************
static int32_t
ScheduleReportTransmission(tHIDInstance *psHIDInst)
{
    uint32_t ui32NumBytes;
    uint8_t *pui8Data;
    int32_t i32Retcode;

    //
    // Set the number of bytes to send this iteration.
    //
    ui32NumBytes = (uint32_t)(psHIDInst->ui16InReportSize -
                              psHIDInst->ui16InReportIndex);

    //
    // Limit individual transfers to the maximum packet size for the endpoint.
    //
    if(ui32NumBytes > USBDHID_MAX_PACKET)
    {
        ui32NumBytes = USBDHID_MAX_PACKET;
    }

    //
    // Where are we sending this data from?
    //
    pui8Data = psHIDInst->pui8InReportData + psHIDInst->ui16InReportIndex;

    //
    // Put the data in the correct FIFO.
    //
    i32Retcode = USBEndpointDataPut(psHIDInst->ui32USBBase,
                                        psHIDInst->ui8INEndpoint,
                                        pui8Data, ui32NumBytes);

    if(i32Retcode != -1)
    {
        //
        // Update the count and index ready for the next time round.
        //
        psHIDInst->ui16InReportIndex += ui32NumBytes;

        //
        // Send out the current data.
        //
        i32Retcode = USBEndpointDataSend(psHIDInst->ui32USBBase,
                                             psHIDInst->ui8INEndpoint,
                                             USB_TRANS_IN);
    }

    //
    // Tell the caller how we got on.
    //
    return(i32Retcode);
}

//*****************************************************************************
//
// Receives notifications related to data received from the host.
//
// \param psHIDDevice is the device instance whose endpoint is to be processed.
// \param ui32Status is the USB interrupt status that caused this function to
// be called.
//
// This function is called from HandleEndpoints for all interrupts signaling
// the arrival of data on the interrupt OUT endpoint (in other words, whenever
// the host has sent us a packet of data).  We inform the client that a packet
// is available and, on return, check to see if the packet has been read.  If
// not, we schedule another notification to the client for a later time.
//
// \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
static bool
ProcessDataFromHost(tUSBDHIDDevice *psHIDDevice, uint32_t ui32Status)
{
    uint32_t ui32EPStatus, ui32Size;
    tHIDInstance *psInst;

    //
    // Get a pointer to our instance data.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Get the endpoint status to see why we were called.
    //
    ui32EPStatus = USBEndpointStatus(USB_BASE, psInst->ui8OUTEndpoint);

    //
    // Clear the status bits.
    //
    USBDevEndpointStatusClear(USB_BASE, psInst->ui8OUTEndpoint,
                                  ui32EPStatus);

    //
    // Has a packet been received?
    //
    if(ui32EPStatus & USB_DEV_RX_PKT_RDY)
    {
        //
        // Set the flag we use to indicate that a packet read is pending.  This
        // will be cleared if the packet is read.  If the client does not read
        // the packet in the context of the USB_EVENT_RX_AVAILABLE callback,
        // the event will be signaled later during tick processing.
        //
        SetDeferredOpFlag(&psInst->ui16DeferredOpFlags, HID_DO_PACKET_RX,
                          true);

        //
        // How big is the packet we have just been sent?
        //
        ui32Size = USBEndpointDataAvail(psInst->ui32USBBase,
                                            psInst->ui8OUTEndpoint);

        //
        // The receive channel is not blocked so let the caller know
        // that a packet is waiting.  The parameters are set to indicate
        // that the packet has not been read from the hardware FIFO yet.
        //
        psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                   USB_EVENT_RX_AVAILABLE, ui32Size,
                                   (void *)0);
    }
    else
    {
        //
        // No packet was received.  Some error must have been reported.  Check
        // and pass this on to the client if necessary.
        //
        if(ui32EPStatus & USB_RX_ERROR_FLAGS)
        {
            //
            // This is an error we report to the client so...
            //
            psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                       USB_EVENT_ERROR,
                                       (ui32EPStatus & USB_RX_ERROR_FLAGS),
                                       (void *)0);
        }
        return(false);
    }

    return(true);
}

//*****************************************************************************
//
// Receives notifications related to data sent to the host.
//
// \param psHIDDevice is the device instance whose endpoint is to be processed.
// \param ui32Status is the USB interrupt status that caused this function to
// be called.
//
// This function is called from HandleEndpoints for all interrupts originating
// from the interrupt IN endpoint (in other words, whenever data has been
// transmitted to the USB host).  We examine the cause of the interrupt and,
// if due to completion of a transmission, notify the client.
//
// \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
static bool
ProcessDataToHost(tUSBDHIDDevice *psHIDDevice, uint32_t ui32Status)
{
    tHIDInstance *psInst;
    uint32_t ui32EPStatus;

    //
    // Get a pointer to our instance data.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Get the endpoint status to see why we were called.
    //
    ui32EPStatus = USBEndpointStatus(psInst->ui32USBBase,
                                         psInst->ui8INEndpoint);

    //
    // Clear the status bits.
    //
    USBDevEndpointStatusClear(psInst->ui32USBBase, psInst->ui8INEndpoint,
                                  ui32EPStatus);

    //
    // Our last packet was transmitted successfully.  Is there any more data to
    // send or have we finished sending the whole report?  We know we finished
    // if the ui16InReportIndex has reached the ui16InReportSize value.
    //
    if(psInst->ui16InReportSize == psInst->ui16InReportIndex)
    {
        //
        // We finished sending the last report so are idle once again.
        //
        psInst->iHIDTxState = eHIDStateIdle;

        //
        // Notify the client that the report transmission completed.
        //
        psHIDDevice->pfnTxCallback(psHIDDevice->pvTxCBData,
                                   USB_EVENT_TX_COMPLETE,
                                   psInst->ui16InReportSize, (void *)0);

        //
        // Do we have any reports to send as a result of idle timer timeouts?
        //
        if(psInst->ui16DeferredOpFlags & ((uint32_t)1 << HID_DO_SEND_IDLE_REPORT))
        {
            //
            // Yes - send reports for any timers that expired recently.
            //
            ProcessIdleTimers(psHIDDevice, 0);
        }
    }
    else
    {
        //
        // There must be more data or a zero length packet waiting to be sent
        // so go ahead and do this.
        //
        ScheduleReportTransmission(psInst);
    }

    return(true);
}

//*****************************************************************************
//
// Called by the USB stack for any activity involving one of our endpoints
// other than EP0.  This function is a fan out that merely directs the call to
// the correct handler depending upon the endpoint and transaction direction
// signaled in ui32Status.
//
//*****************************************************************************
static void
HandleEndpoints(void *pvHIDInstance, uint32_t ui32Status)
{
    tUSBDHIDDevice *psHIDInst;
    tHIDInstance *psInst;

    ASSERT(pvHIDInstance != 0);

    //
    // Determine if the serial device is in single or composite mode because
    // the meaning of ui32Index is different in both cases.
    //
    psHIDInst = (tUSBDHIDDevice *)pvHIDInstance;
    psInst = &psHIDInst->sPrivateData;

    //
    // Handler for the interrupt OUT data endpoint.
    //
    if(ui32Status & ((uint32_t)0x10000 << USBEPToIndex(psInst->ui8OUTEndpoint)))
    {
        //
        // Data is being sent to us from the host.
        //
        ProcessDataFromHost(pvHIDInstance, ui32Status);
    }

    //
    // Handler for the interrupt IN data endpoint.
    //
    if(ui32Status & ((uint32_t)1 << USBEPToIndex(psInst->ui8INEndpoint)))
    {
        ProcessDataToHost(pvHIDInstance, ui32Status);
    }
}

