TexasInstruments/c2000ware-core-sdk/libraries/communications/usb/f2838x/source/device/usbdhid.c
//*****************************************************************************
//
// Called by the USB stack whenever a configuration change occurs.
//
//*****************************************************************************
static void
HandleConfigChange(void *pvHIDInstance, uint32_t ui32Info)
{
    tHIDInstance *psInst;
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Create the instance pointer.
    //
    psHIDDevice = pvHIDInstance;

    //
    // Get a pointer to our instance data.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Set all our endpoints to idle state.
    //
    psInst->iHIDRxState = eHIDStateIdle;
    psInst->iHIDTxState = eHIDStateIdle;

    //
    // If we are not currently connected let the client know we are open for
    // business.
    //
    if(!psInst->bConnected)
    {
        //
        // Pass the connected event to the client.
        //
        psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                   USB_EVENT_CONNECTED, 0, (void *)0);
    }

    //
    // Clear the idle timers for each input report.
    //
    ClearIdleTimers(psHIDDevice);

    //
    // Remember that we are connected.
    //
    psInst->bConnected = true;
}

//*****************************************************************************
//
// Device instance specific handler.
//
//*****************************************************************************
static void
HandleDevice(void *pvHIDInstance, uint32_t ui32Request, void *pvRequestData)
{
    tHIDInstance *psInst;
    uint8_t *pui8Data;

    //
    // Create the serial instance data.
    //
    psInst = &((tUSBDHIDDevice *)pvHIDInstance)->sPrivateData;

    //
    // Create the int8_t array used by the events supported by the USB CDC
    // serial class.
    //
    pui8Data = (uint8_t *)pvRequestData;

    switch(ui32Request)
    {
        //
        // This was an interface change event.
        //
        case USB_EVENT_COMP_IFACE_CHANGE:
        {
            psInst->ui8Interface = pui8Data[1];
            break;
        }

        //
        // This was an endpoint change event.
        //
        case USB_EVENT_COMP_EP_CHANGE:
        {
            //
            // Determine if this is an IN or OUT endpoint that has changed.
            //
            if(pui8Data[0] & USB_EP_DESC_IN)
            {
                psInst->ui8INEndpoint = IndexToUSBEP((pui8Data[1] & 0x7f));
            }
            else
            {
                //
                // Extract the new endpoint number.
                //
                psInst->ui8OUTEndpoint = IndexToUSBEP(pui8Data[1] & 0x7f);
            }
            break;
        }
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// disconnected from the host.
//
//*****************************************************************************
static void
HandleDisconnect(void *pvHIDInstance)
{
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Create the instance pointer.
    //
    psHIDDevice = (tUSBDHIDDevice *)pvHIDInstance;

    //
    // If we are not currently connected so let the client know we are open
    // for business.
    //
    if(psHIDDevice->sPrivateData.bConnected)
    {
        //
        // Pass the disconnected event to the client.
        //
        psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                   USB_EVENT_DISCONNECTED, 0, (void *)0);
    }

    //
    // Remember that we are no longer connected.
    //
    psHIDDevice->sPrivateData.bConnected = false;
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a request for a
// non-standard descriptor is received.
//
// \param pvHIDInstance is the instance data for this request.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure and determines which
// descriptor is being requested.  Assuming the descriptor can be found, it is
// scheduled for transmission via endpoint zero.  If the descriptor cannot be
// found, the endpoint is stalled to indicate an error to the host.
//
//*****************************************************************************
static void
HandleGetDescriptor(void *pvHIDInstance, tUSBRequest *psUSBRequest)
{
    uint32_t ui32Size, ui32Desc;
    const tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Which device are we dealing with?
    //
    psHIDDevice = pvHIDInstance;

    //
    // Which type of class descriptor are we being asked for?
    //
#ifdef __TMS320C28XX__
    switch(readusb16_t(&(psUSBRequest->wValue)) >> 8)
#else
    switch(psUSBRequest->wValue >> 8)
#endif
    {
        //
        // This is a request for a HID report or physical descriptor.
        //
        case USB_HID_DTYPE_REPORT:
        case USB_HID_DTYPE_PHYSICAL:
        {
            //
            // Find the index to the descriptor that is being queried.
            //
            ui32Size = 0;
            ui32Desc = FindHIDDescriptor(psHIDDevice,
#ifdef __TMS320C28XX__
										 readusb16_t(&(psUSBRequest->wValue)) >> 8,
										 readusb16_t(&(psUSBRequest->wValue)) & 0xFF,
#else
                                         psUSBRequest->wValue >> 8,
                                         psUSBRequest->wValue & 0xFF,
#endif
										&ui32Size);

            //
            // Did we find the descriptor?
            //
            if(ui32Desc == HID_NOT_FOUND)
            {
                //
                // No - stall the endpoint and return.
                //
                USBDCDStallEP0(0);
                return;
            }

            //
            // If there is more data to send than the host requested then just
            // send the requested amount of data.
            //
#ifdef __TMS320C28XX__
            if(ui32Size > readusb16_t(&(psUSBRequest->wLength)))
            {
                ui32Size = readusb16_t(&(psUSBRequest->wLength));
#else
            if(ui32Size > psUSBRequest->wLength)
            {
                ui32Size = psUSBRequest->wLength;
#endif
            }

            //
            // Send the data via endpoint 0.
            //
            USBDCDSendDataEP0(0,
                (uint8_t *)psHIDDevice->ppui8ClassDescriptors[ui32Desc],
                ui32Size);

            break;
        }

        //
        // This is a request for the HID descriptor (as found in the
        // configuration descriptor following the relevant interface).
        //
        case USB_HID_DTYPE_HID:
        {
            //
            // How big is the HID descriptor?
            //
            ui32Size = (uint32_t)psHIDDevice->psHIDDescriptor->bLength;

            //
            // If there is more data to send than the host requested then just
            // send the requested amount of data.
            //
#ifdef __TMS320C28XX__
            if(ui32Size > readusb16_t(&(psUSBRequest->wLength)))
            {
                ui32Size = readusb16_t(&(psUSBRequest->wLength));
#else
            if(ui32Size > psUSBRequest->wLength)
            {
                ui32Size = psUSBRequest->wLength;
#endif
            }

            //
            // Send the data via endpoint 0.
            //
            USBDCDSendDataEP0(0, (uint8_t *)psHIDDevice->psHIDDescriptor,
                              ui32Size);
            break;
        }

        //
        // This was an unknown request so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvHIDInstance is the instance data for this HID device.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure.  Assuming the request is
// understood, it is handled and any required response generated.  If the
// request cannot be handled by this device class, endpoint zero is stalled to
// indicate an error to the host.
//
//*****************************************************************************
static void
HandleRequest(void *pvHIDInstance, tUSBRequest *psUSBRequest)
{
    tHIDInstance *psInst;
    uint8_t ui8Protocol;
    uint32_t ui32Size, ui32Timeout;
    uint8_t *pui8Report;
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Which device are we dealing with?
    //
    psHIDDevice = pvHIDInstance;

    //
    // Get a pointer to our instance data.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Make sure the request was for this interface.
    //
#ifdef __TMS320C28XX__
    if(readusb16_t(&(psUSBRequest->wIndex)) != psInst->ui8Interface)
#else
    if(psUSBRequest->wIndex != psInst->ui8Interface)
#endif
    {
        return;
    }

    //
    // Determine the type of request.
    //
    switch(psUSBRequest->bRequest)
    {
        //
        // A Set Report request is received from the host when it sends an
        // Output report via endpoint 0.
        //
        case USBREQ_SET_REPORT:
        {
            //
            // Ask the application for a buffer large enough to hold the
            // report we are to be sent.
            //
#ifdef __TMS320C28XX__
            psInst->ui16OutReportSize = readusb16_t(&(psUSBRequest->wLength));
#else
            psInst->ui16OutReportSize = psUSBRequest->wLength;
#endif
            psInst->pui8OutReportData =
                (uint8_t *)psHIDDevice->pfnRxCallback(
                               psHIDDevice->pvRxCBData,
                               USBD_HID_EVENT_GET_REPORT_BUFFER,
#ifdef __TMS320C28XX__
                               readusb16_t(&(psUSBRequest->wValue)),
                               (void *)(uint32_t)(readusb16_t(&(psUSBRequest->wLength))));
#else
                               psUSBRequest->wValue,
                               (void *)(uint32_t)(psUSBRequest->wLength));
#endif

            //
            // Did the client provide us a buffer?
            //
            if(!psInst->pui8OutReportData)
            {
                //
                // The application could not provide us a buffer so stall the
                // request.
                //
                USBDCDStallEP0(0);
            }
            else
            {
                //
                // The client provided us a buffer to read the report into
                // so request the data from the host.
                //

                //
                // Set the state to indicate we are waiting for data.
                //
                psInst->iHIDRxState = eHIDStateWaitData;

                //
                // Now read the payload of the request.  We handle the actual
                // operation in the data callback once this data is received.
                //
                USBDCDRequestDataEP0(0, psInst->pui8OutReportData,
#ifdef __TMS320C28XX__
                                     (uint32_t)readusb16_t(&(psUSBRequest->wLength)));
#else
                                     (uint32_t)psUSBRequest->wLength);
#endif

                //
                // Need to ACK the data on end point 0 in this case.  Do this
                // after requesting the data to prevent race conditions that
                // occur if you acknowledge before setting up to receive the
                // request data.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, false);
            }

            break;
        }

        //
        // A Get Report request is used by the host to poll a device for its
        // current state.
        //
        case USBREQ_GET_REPORT:
        {
            //
            // Get the latest report from the application.
            //
            ui32Size = psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                            USBD_HID_EVENT_GET_REPORT,
#ifdef __TMS320C28XX__
                                            readusb16_t(&(psUSBRequest->wValue)), &pui8Report);
#else
                                            psUSBRequest->wValue, &pui8Report);
#endif

            //
            // Need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, true);

            //
            // ..then send back the requested report.
            //
            psInst->bGetRequestPending = true;
            USBDCDSendDataEP0(0, pui8Report, ui32Size);

            break;
        }

        //
        // A set IDLE request has been made.  This indicates to us how often a
        // given report should be sent back to the host in the absence of any
        // change in state of the device.
        //
        case USBREQ_SET_IDLE:
        {
            //
            // Set the idle timeout for the requested report(s).
            //
#ifdef __TMS320C28XX__
            SetIdleTimeout(psHIDDevice, readusb16_t(&(psUSBRequest->wValue)) & 0xFF,
                           (readusb16_t(&(psUSBRequest->wValue)) >> 8) & 0xFF);
#else
            SetIdleTimeout(psHIDDevice, psUSBRequest->wValue & 0xFF,
                           (psUSBRequest->wValue >> 8) & 0xFF);
#endif

            //
            // Need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, true);

            break;
        }

        //
        // A get IDLE request has been made.  This request queries the current
        // idle timeout for a given report.
        //
        case USBREQ_GET_IDLE:
        {
            //
            // Determine the timeout for the requested report.
            //
#ifdef __TMS320C28XX__
            ui32Timeout = GetIdleTimeout(psHIDDevice, readusb16_t(&(psUSBRequest->wValue)));
#else
            ui32Timeout = GetIdleTimeout(psHIDDevice, psUSBRequest->wValue);
#endif

