TexasInstruments/c2000ware-core-sdk/libraries/communications/usb/f2838x/source/device/usbdhid.c
            if(ui32Timeout != HID_NOT_FOUND)
            {
                //
                // Need to ACK the data on end point 0 in this case.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, true);

                //
                // Send our response to the host.
                //
                USBDCDSendDataEP0(0, (uint8_t *)&ui32Timeout, 1);
            }
            else
            {
                //
                // The report ID was not found so stall the endpoint.
                //
                USBDCDStallEP0(0);
            }
            break;
        }

        //
        // Set either boot or report protocol for reports sent from the device.
        // This is only supported by devices in the boot subclass.
        //
        case USBREQ_SET_PROTOCOL:
        {
            if(psHIDDevice->ui8Subclass == USB_HID_SCLASS_BOOT)
            {
                //
                // We need to ACK the data on end point 0 in this case.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, true);

                //
                // We are a boot subclass device so pass this on to the
                // application.
                //
                psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                           USBD_HID_EVENT_SET_PROTOCOL,
#ifdef __TMS320C28XX__
                                           readusb16_t(&(psUSBRequest->wValue)),
#else
                                           psUSBRequest->wValue,
#endif
                                           (void *)0);
            }
            else
            {
                //
                // This is not a boot subclass device so stall the endpoint to
                // show that we don't support this request.
                //
                USBDCDStallEP0(0);
            }
            break;
        }

        //
        // Inform the host of the protocol, boot or report, that is currently
        // in use.  This is only supported by devices in the boot subclass.
        //
        case USBREQ_GET_PROTOCOL:
        {
            if(psHIDDevice->ui8Subclass == USB_HID_SCLASS_BOOT)
            {
                //
                // We need to ACK the data on end point 0 in this case.
                //
                USBDevEndpointDataAck(psInst->ui32USBBase, USB_EP_0, true);

                //
                // We are a boot subclass device so pass this on to the
                // application callback to get the answer.
                //
                ui8Protocol = (uint8_t)psHIDDevice->pfnRxCallback(
                    psHIDDevice->pvRxCBData, USBD_HID_EVENT_GET_PROTOCOL, 0,
                    (void *)0);

                //
                // Send our response to the host.
                //
                USBDCDSendDataEP0(0, (uint8_t *)&ui8Protocol, 1);
            }
            else
            {
                //
                // This is not a boot subclass device so stall the endpoint to
                // show that we don't support this request.
                //
                USBDCDStallEP0(0);
            }
            break;
        }

        //
        // This request was not recognized so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the data requested
// on endpoint zero is received.
//
//*****************************************************************************
static void
HandleEP0DataReceived(void *pvHIDInstance, uint32_t ui32DataSize)
{
    tHIDInstance *psInst;
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Which device are we dealing with?
    //
    psHIDDevice = pvHIDInstance;

    //
    // If we were not passed any data, just return.
    //
    if(ui32DataSize == 0)
    {
        return;
    }

    //
    // Get our instance data pointer.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Make sure we are actually expecting something.
    //
    if(psInst->iHIDRxState != eHIDStateWaitData)
    {
        return;
    }

    //
    // Change the endpoint state back to idle now that we have been passed
    // the data we were waiting for.
    //
    psInst->iHIDRxState = eHIDStateIdle;

    //
    // The only things we ever request via endpoint zero are reports sent to
    // us via a Set_Report request.  Pass the newly received report on to
    // the client.
    //
    psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                               USBD_HID_EVENT_SET_REPORT,
                               psInst->ui16OutReportSize,
                               psInst->pui8OutReportData);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the data sent on
// endpoint zero is received and acknowledged by the host.
//
//*****************************************************************************
static void
HandleEP0DataSent(void *pvHIDInstance, uint32_t ui32Info)
{
    tHIDInstance *psInst;
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Which device are we dealing with?
    //
    psHIDDevice = pvHIDInstance;

    //
    // Get our instance data pointer.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // If we just sent a report in response to a Get_Report request, send an
    // event to the application telling it that the transmission completed.
    //
    if(psInst->bGetRequestPending)
    {
        //
        // Clear the flag now that we are sending the application callback.
        //
        psInst->bGetRequestPending = false;

        psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                   USBD_HID_EVENT_REPORT_SENT, 0, (void *)0);
    }

    return;
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the device is
// reset.  If we are currently connected, send a disconnect event at this
// point.
//
//*****************************************************************************
static void
HandleReset(void *pvHIDInstance)
{
    ASSERT(pvHIDInstance != 0);

    //
    // Merely call the disconnect handler.  This causes a disconnect message to
    // be sent to the client if we think we are currently connected.
    //
    HandleDisconnect(pvHIDInstance);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the bus is put into
// suspend state.
//
//*****************************************************************************
static void
HandleSuspend(void *pvHIDInstance)
{
    const tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Create the instance pointer.
    //
    psHIDDevice = (const tUSBDHIDDevice *)pvHIDInstance;

    //
    // Pass the event on to the client.
    //
    psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData, USB_EVENT_SUSPEND, 0,
                               (void *)0);
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever the bus is taken
// out of suspend state.
//
//*****************************************************************************
static void
HandleResume(void *pvHIDInstance)
{
    const tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Create the instance pointer.
    //
    psHIDDevice = (const tUSBDHIDDevice *)pvHIDInstance;

    //
    // Pass the event on to the client.
    //
    psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData, USB_EVENT_RESUME, 0,
                               (void *)0);
}

//*****************************************************************************
//
// This function is called periodically and provides us with a time reference
// and method of implementing delayed or time-dependent operations.
//
// \param pvHIDInstance is the instance data for this request.
// \param ui32TimemS is the elapsed time in milliseconds since the last call
// to this function.
//
// \return None.
//
//*****************************************************************************
static void
HIDTickHandler(void *pvHIDInstance, uint32_t ui32TimemS)
{
    tHIDInstance *psInst;
    uint32_t ui32Size;
    tUSBDHIDDevice *psHIDDevice;

    ASSERT(pvHIDInstance != 0);

    //
    // Create the instance pointer.
    //
    psHIDDevice = (tUSBDHIDDevice *)pvHIDInstance;

    //
    // Get our instance data pointer.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // If we are connected, process our idle timers.
    //
    if(psInst->bConnected)
    {
        ProcessIdleTimers(psHIDDevice, ui32TimemS);
    }

    //
    // Do we have a deferred receive waiting
    //
    if(psInst->ui16DeferredOpFlags & ((uint32_t)1 << HID_DO_PACKET_RX))
    {
        //
        // Yes - how big is the waiting packet?
        //
        ui32Size = USBEndpointDataAvail(USB_BASE, psInst->ui8OUTEndpoint);

        //
        // Tell the client that there is a packet waiting for it.
        //
        psHIDDevice->pfnRxCallback(psHIDDevice->pvRxCBData,
                                   USB_EVENT_RX_AVAILABLE, ui32Size,
                                   (void *)0);
    }

    return;
}

//*****************************************************************************
//
//! Initializes HID device operation for a given USB controller.
//!
//! \param ui32Index is the index of the USB controller which is to be
//! initialized for HID device operation.
//! \param psHIDDevice points to a structure containing parameters customizing
//! the operation of the HID device.
//!
//! An application wishing to offer a USB HID interface to a host system
//! must call this function to initialize the USB controller and attach the
//! device to the USB bus.  This function performs all required USB
//! initialization.
//!
//! On successful completion, this function will return the \e psHIDDevice
//! pointer passed to it.  This must be passed on all future calls from the
//! application to the HID device class driver.
//!
//! The USB HID device class API offers the application a report-based transmit
//! interface for Input reports.  Output reports may be received via the
//! control endpoint or via a dedicated Interrupt OUT endpoint.  If using the
//! dedicated endpoint, report data is delivered to the application packet-by-
//! packet.  If the application uses reports longer than \b USBDHID_MAX_PACKET
//! bytes and would rather receive full reports, it may use a USB buffer above
//! the receive channel to allow full reports to be read.
//!
//! Transmit Operation:
//!
//! Calls to USBDHIDReportWrite() pass complete reports to the driver for
//! transmission.  These will be transmitted to the host using as many USB
//! packets as are necessary to complete the transmission.
//!
//! Once a full Input report has been acknowledged by the USB host, a
//! \b USB_EVENT_TX_COMPLETE event is sent to the application transmit callback
//! to inform it that another report may be transmitted.
//!
//! Receive Operation (when using a dedicated interrupt OUT endpoint):
//!
//! An incoming USB data packet will result in a call to the application
//! callback with event \b USB_EVENT_RX_AVAILABLE.  The application must then
//! call USBDHIDPacketRead(), passing a buffer capable of holding the received
//! packet.  The size of the packet may be determined by calling function
//! USBDHIDRxPacketAvailable() prior to reading the packet.
//!
//! Receive Operation (when not using a dedicated OUT endpoint):
//!
//! If no dedicated OUT endpoint is used, Output and Feature reports are sent
//! from the host using the control endpoint, endpoint zero.  When such a
//! report is received, \b USBD_HID_EVENT_GET_REPORT_BUFFER is sent to the
//! application which must respond with a buffer large enough to hold the
//! report.  The device class driver will then copy the received report into
//! the supplied buffer before sending \b USBD_HID_EVENT_SET_REPORT to indicate
//! that the report is now available.
//!
//! \note The application must not make any calls to the low level USB device
//! interface if interacting with USB via the USB HID device class API.  Doing
//! so will cause unpredictable (though almost certainly unpleasant) behavior.
//!
//! \return Returns NULL on failure or the \e psHIDDevice pointer on success.
//
//*****************************************************************************
void *
USBDHIDInit(uint32_t ui32Index, tUSBDHIDDevice *psHIDDevice)
{
    tDeviceDescriptor *pi16DevDesc;

    //
    // Check parameter validity.
    //
    ASSERT(ui32Index == 0);
    ASSERT(psHIDDevice);
    ASSERT(psHIDDevice->ppui8StringDescriptors);
    ASSERT(psHIDDevice->pfnRxCallback);
    ASSERT(psHIDDevice->pfnTxCallback);
    ASSERT(psHIDDevice->ppui8ClassDescriptors);
    ASSERT(psHIDDevice->psHIDDescriptor);
    ASSERT((psHIDDevice->ui8NumInputReports == 0) || psHIDDevice->psReportIdle);

    USBDHIDCompositeInit(ui32Index, psHIDDevice, 0);

    //
    // Fix up the device descriptor with the client-supplied values.
    //
    pi16DevDesc = (tDeviceDescriptor *)psHIDDevice->sPrivateData.sDevInfo.pui8DeviceDescriptor;
#ifdef __TMS320C28XX__
    writeusb16_t(&(pi16DevDesc->idVendor), psHIDDevice->ui16VID);
    writeusb16_t(&(pi16DevDesc->idProduct), psHIDDevice->ui16PID);
#else
    pi16DevDesc->idVendor = psHIDDevice->ui16VID;
    pi16DevDesc->idProduct = psHIDDevice->ui16PID;
#endif

    //
    // All is well so now pass the descriptors to the lower layer and put
    // the HID device on the bus.
    //
    USBDCDInit(ui32Index, &psHIDDevice->sPrivateData.sDevInfo,
               (void *)psHIDDevice);

    //
    // Return the pointer to the instance indicating that everything went well.
    //
    return((void *)psHIDDevice);
}

//*****************************************************************************
//
//! Initializes HID device operation for a given USB controller.
//!
//! \param ui32Index is the index of the USB controller which is to be
//! initialized for HID device operation.
//! \param psHIDDevice points to a structure containing parameters customizing
//! the operation of the HID device.
//! \param psCompEntry is the composite device entry to initialize when
//! creating a composite device.
//!
//! USB HID device classes call this function to initialize the lower level
//! HID interface in the USB controller.  If this HID device device is part of
//! a composite device, then the \e psCompEntry should point to the composite
//! device entry to initialize.  This is part of the array that is passed to
//! the USBDCompositeInit() function.
//!
//! \return Returns zero on failure or a non-zero instance value that should be
//! used with the remaining USB HID APIs.
//
//*****************************************************************************
void *
USBDHIDCompositeInit(uint32_t ui32Index, tUSBDHIDDevice *psHIDDevice,
                     tCompositeEntry *psCompEntry)
{
    tHIDInstance *psInst;
    tEndpointDescriptor *psEndpoint;

    //
    // Check parameter validity.
    //
    ASSERT(ui32Index == 0);
    ASSERT(psHIDDevice);
    ASSERT(psHIDDevice->ppsConfigDescriptor);
    ASSERT(psHIDDevice->ppui8StringDescriptors);
    ASSERT(psHIDDevice->pfnRxCallback);
    ASSERT(psHIDDevice->pfnTxCallback);
    ASSERT(psHIDDevice->ppui8ClassDescriptors);
    ASSERT(psHIDDevice->psHIDDescriptor);
    ASSERT((psHIDDevice->ui8NumInputReports == 0) || psHIDDevice->psReportIdle);

    //
    // Initialize the workspace in the passed instance structure.
    //
    psInst = &psHIDDevice->sPrivateData;

    //
    // Initialize the device information structure.
    //
    psInst->sDevInfo.psCallbacks = &g_sHIDHandlers;
    psInst->sDevInfo.pui8DeviceDescriptor = g_pui8HIDDeviceDescriptor;
    psInst->sDevInfo.ppsConfigDescriptors = psHIDDevice->ppsConfigDescriptor;
    psInst->sDevInfo.ppui8StringDescriptors =
                                        psHIDDevice->ppui8StringDescriptors;
    psInst->sDevInfo.ui32NumStringDescriptors =
                                        psHIDDevice->ui32NumStringDescriptors;

    //
    // Default the endpoints zero before looking for them in the configuration
    // descriptor.
    //
    psInst->ui8Interface = 0;
    psInst->ui8INEndpoint = 0;
    psInst->ui8OUTEndpoint = 0;

    //
    // Get the first endpoint descriptor on interface 0.
    //
    psEndpoint =
        USBDCDConfigGetInterfaceEndpoint(psHIDDevice->ppsConfigDescriptor[0],
                                         psInst->ui8Interface, 0, 0);

